package com.guhecloud.platform.dcm;

/**
 * 基于DCM 规则下可标识， 可判定相等的对象需要实现的规格。
 * <p>
 * 可标识的原则, 定义为明确可比对范围中的可标识，具体掌握尺度由使用者确定。
 * 如部分设计(顶层的标识必须是)可以是全局可标识， 部分设计（中间节点）可以是局部可标识。
 */
public interface Identifiable {

    /**
     * 获取对象的标识符. 进行差异比较时，有相同的Identifier的两个配置对象被视同同一个配置项目。 如果相同Identifier的配置项已存在，则不需要再新增。
     * 生成的Id是全局唯一， 还是局部唯一， 并不做约束， 但必须在树中同级唯一。具体的实现可以选择不同策略。
     *
     * @return
     */
    String getId();

    /**
     * 获取对象指纹。 同一个配置项目， 如果其指纹相同， 则从逻辑上认为其内容已经相同， 不需要再进行额外的更新。
     * （当然实际可能仍然存在细微差异）。
     * 如果我们计划忽略某些字段， 那么就不要在实现中将对应字段考虑在内， 否则将会造成反复更新始终存在差异的问题。
     * 指纹的比较仅在Id相同的情况下进行。
     *
     * @return
     */
    String getFingerPrint();
}
